colors/app/controllers/authentication_controller.rb

    def login
        @user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'kyle.c.r.fahey@gmail.com' LIMIT 1