colors/app/controllers/colors_controller.rb

SELECT `colors`.* FROM `colors` ORDER BY `colors`.`created_at` DESC LIMIT 50
---
    def index
        @colors = Color.order(created_at: :desc).take(50)