colors/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`, `bio`, `first_name`, `last_name`, `job_title`, `company`) VALUES ('kyle.c.r.fahey@gmail.com', '$2a$12$7zIV4hSqdVDkMQSmnCJut.LzI2l3s9TsNSRI9EG.SDAYYOMnucCPK', '2019-11-18 01:17:14.081386', '2019-11-18 01:17:14.081386', '0', 'Kyle', 'Fahey', 'Test', 'Test Company')